In [24]:
#Import library
import os
import csv

In [25]:
# Import Dependencies
import pandas as pd

In [26]:
# Set path to collect data
path = os.path.join("DataShopify.csv")

In [27]:
pwd

'C:\\Shawn Desai\\Jobs - 2021\\Companies\\Shopify'

In [28]:
cd C:\Shawn Desai\Jobs - 2021\Companies\Shopify

C:\Shawn Desai\Jobs - 2021\Companies\Shopify

In [29]:
# Import the data set as a DataFrame
df = pd.read_csv(path)
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

In [30]:
df.dtypes

order_id           int64
shop_id            int64
user_id            int64
order_amount       int64
total_items        int64
payment_method    object
created_at        object
dtype: object

In [31]:
df.count()

order_id          5000
shop_id           5000
user_id           5000
order_amount      5000
total_items       5000
payment_method    5000
created_at        5000
dtype: int64

In [33]:
df.isna().sum()

order_id          0
shop_id           0
user_id           0
order_amount      0
total_items       0
payment_method    0
created_at        0
dtype: int64

In [32]:
df.describe()

          order_id      shop_id      user_id   order_amount  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

In [82]:
# Question 2: What metric would you report for this dataset?

# Reporting metrics: 

# Order Amount 
# Total Items

In [83]:
# To determine Average Order Value (AOV)

# First determine sums of both 'order_amount' and 'total_items'
OAmt = df.order_amount.sum()
Titem = df.total_items.sum()
print(OAmt)
print(Titem)

15725640
43936

In [84]:
# Then calculate average by dividing the total order amount (oa_sum) by the total items amount (ti_sum)
AOV = OAmt/Titem
print(AOV)

357.92152221412965

In [85]:
# Print Average Order Value (AOV) with only 2 decimal places and the dollar sign
print("%.2f" % AOV)

357.92

In [86]:
# Print correct explanation with $
'${:,.2f}'.format(AOV)

'$357.92'

In [87]:
# Incorrect calculation explained as a mistaken count() instead of sum() function
OAmt = df.order_amount.sum()
Totem = df.total_items.count()
AOVa = OAmt/Totem
print(AOVa)

3145.128

In [34]:
# Incorrect calculation can also be due to just considering the average of order_amount instead of calculating AOV
df.order_amount.mean()

3145.128